chore: move ckms from CLI repo into KMS (#722)
* fix: branding, security issue on KMIP import when replace_existing is… (#735)

* fix: branding, security issue on KMIP import when replace_existing is true + add docs on OpenSSL override

* fix: ci

* fix: update Nix hashes

* feat: add KMS server version on startup logs

* docs: reorganize README.md

* fix: GHSA-mw96

* fix: update Nix hashes

* fix: pnpm-lock.yaml

* fix: pnpm-lock.yaml

* fix: pnpm-lock.yaml

* chore: update Nix expected hash

* chore: refactor du to simplifications of ckms.toml

* docs: auto generate server doc

* fix(publish): keep a kms_template.toml

* fix: move clippy rules
